apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_pin.h
/****************************************************************************
 * arch/arm/src/s32k3xx/s32k3xx_pin.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_S32K3XX_S32K3XX_PIN_H
#define __ARCH_ARM_SRC_S32K3XX_S32K3XX_PIN_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/compiler.h>
#include <nuttx/irq.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>

#include <hardware/s32k3xx_siul2.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Bit-encoded input to s32k3xx_pinconfig() *********************************/

/* General form (32 bits):
 *
 * oooo oooo iiii iiii ittt tsss pppn nnnn
 *         |           |    |  |   |     `--- n: Pin number (0-31)
 *         |           |    |  |   `--- p: Port (A-F)
 *         |           |    |  `--- s: Output SSS (Source Signal Select)
 *         |           |    `--- t: Input SSS (Source Signal Select)
 *         |           `--- i: IMCR (Input Multiplexing Config. Register)
 *         `--- o: Options (see below!)
 *
 * Note: IMCR field may instead contain the external WKPU source number, if
 *       Input SSS is set to 12.
 *
 * Options:
 * - Bit 24: PUE (Pull Up Enable)
 * - Bit 25: PUS (Pull Up Select)
 * - Bit 26: OBE (Output Buffer Enable)
 * - Bit 27: DSE (Drive Strength Enable)
 * - Bit 28: SRC (Slew Rate Control)
 * - Bit 29: GPIO Initial Value
 * - Bit 30: EIRQ/WKPU Enable Interrupt on Rising Edge
 * - Bit 31: EIRQ/WKPU Enable Interrupt on Falling Edge
 *
 * Not (yet) included/implemented:
 * - IBE (Input Buffer Enable)  --> IBE will be enabled for all configured
 *                                  pins.  No option needed.
 * - IFE (Input Filter Enable)  --> Only available for RESET pin.
 * - PKE (Pad Keeping Enable)   --> Keep I/O configuration when switching
 *                                  between Run and Standby modes.
 * - SMC (Safe Mode Control)    --> Output buffer will be disabled by default
 *                                  when chip enters safe mode.
 * - INV (Invert)               --> Invert all pad output.
 *
 * - Selection between DMA or interrupt request (currently only interrupts
 *   are supported).
 * - Configuration of interrupt glitch filter.
 */

/* Five bits are used to define the pin number:
 *
 * ---- ---- ---- ---- ---- ---- ---n nnnn
 */

#define _PIN_SHIFT                 (0)  /* Bits 0-4: Pin number (0-31) */
#define _PIN_MASK                  (0x1f << _PIN_SHIFT)

#define PIN(n)                     ((n) << _PIN_SHIFT)
#define PIN0                       (0 << _PIN_SHIFT)
#define PIN1                       (1 << _PIN_SHIFT)
#define PIN2                       (2 << _PIN_SHIFT)
#define PIN3                       (3 << _PIN_SHIFT)
#define PIN4                       (4 << _PIN_SHIFT)
#define PIN5                       (5 << _PIN_SHIFT)
#define PIN6                       (6 << _PIN_SHIFT)
#define PIN7                       (7 << _PIN_SHIFT)
#define PIN8                       (8 << _PIN_SHIFT)
#define PIN9                       (9 << _PIN_SHIFT)
#define PIN10                      (10 << _PIN_SHIFT)
#define PIN11                      (11 << _PIN_SHIFT)
#define PIN12                      (12 << _PIN_SHIFT)
#define PIN13                      (13 << _PIN_SHIFT)
#define PIN14                      (14 << _PIN_SHIFT)
#define PIN15                      (15 << _PIN_SHIFT)
#define PIN16                      (16 << _PIN_SHIFT)
#define PIN17                      (17 << _PIN_SHIFT)
#define PIN18                      (18 << _PIN_SHIFT)
#define PIN19                      (19 << _PIN_SHIFT)
#define PIN20                      (20 << _PIN_SHIFT)
#define PIN21                      (21 << _PIN_SHIFT)
#define PIN22                      (22 << _PIN_SHIFT)
#define PIN23                      (23 << _PIN_SHIFT)
#define PIN24                      (24 << _PIN_SHIFT)
#define PIN25                      (25 << _PIN_SHIFT)
#define PIN26                      (26 << _PIN_SHIFT)
#define PIN27                      (27 << _PIN_SHIFT)
#define PIN28                      (28 << _PIN_SHIFT)
#define PIN29                      (29 << _PIN_SHIFT)
#define PIN30                      (30 << _PIN_SHIFT)
#define PIN31                      (31 << _PIN_SHIFT)

/* Three bits are used to define the port number:
 *
 * ---- ---- ---- ---- ---- ---- ppp- ----
 */

#define _PIN_PORT_SHIFT            (5)  /* Bits 5-7: Port (A-F) */
#define _PIN_PORT_MASK             (0x07 << _PIN_PORT_SHIFT)

#define PIN_PORTA                  (S32K3XX_PORTA << _PIN_PORT_SHIFT)
#define PIN_PORTB                  (S32K3XX_PORTB << _PIN_PORT_SHIFT)
#define PIN_PORTC                  (S32K3XX_PORTC << _PIN_PORT_SHIFT)
#define PIN_PORTD                  (S32K3XX_PORTD << _PIN_PORT_SHIFT)
#define PIN_PORTE                  (S32K3XX_PORTE << _PIN_PORT_SHIFT)
#define PIN_PORTF                  (S32K3XX_PORTF << _PIN_PORT_SHIFT)
#define PIN_PORTG                  (S32K3XX_PORTG << _PIN_PORT_SHIFT)

/* Sixteen bits are used to define the input/output multiplexing:
 *
 * ---- ---- iiii iiii ittt tsss ---- ----
 */

#define _PIN_MODE_SHIFT            (8)  /* Bits 8-23: Pin Mode */
#define _PIN_MODE_MASK             (0xffff << _PIN_MODE_SHIFT)

/* Of which three bits are used to define the output multiplexing:
 *
 * ---- ---- ---- ---- ---- -sss ---- ----
 */

#define _PIN_OUTPUT_MODE_SHIFT     (8)  /* Bits 8-10: Pin Output Mode */
#define _PIN_OUTPUT_MODE_MASK      (0x07 << _PIN_OUTPUT_MODE_SHIFT)

#define _PIN_MODE_GPIO             (0x00) /* 000 GPIO */
#define _PIN_OUTPUT_MODE_ALT0      _PIN_MODE_GPIO
#define _PIN_OUTPUT_MODE_ALT1      (0x01) /* 001 Output Alternative 1 */
#define _PIN_OUTPUT_MODE_ALT2      (0x02) /* 010 Output Alternative 2 */
#define _PIN_OUTPUT_MODE_ALT3      (0x03) /* 011 Output Alternative 3 */
#define _PIN_OUTPUT_MODE_ALT4      (0x04) /* 100 Output Alternative 4 */
#define _PIN_OUTPUT_MODE_ALT5      (0x05) /* 101 Output Alternative 5 */
#define _PIN_OUTPUT_MODE_ALT6      (0x06) /* 110 Output Alternative 6 */
#define _PIN_OUTPUT_MODE_ALT7      (0x07) /* 111 Output Alternative 7 */

#define PIN_MODE_GPIO              (_PIN_MODE_GPIO        << _PIN_OUTPUT_MODE_SHIFT) /* 000 GPIO */
#define PIN_OUTPUT_MODE_ALT0       PIN_MODE_GPIO
#define PIN_OUTPUT_MODE_ALT1       (_PIN_OUTPUT_MODE_ALT1 << _PIN_OUTPUT_MODE_SHIFT) /* 001 Output Alternative 1 */
#define PIN_OUTPUT_MODE_ALT2       (_PIN_OUTPUT_MODE_ALT2 << _PIN_OUTPUT_MODE_SHIFT) /* 010 Output Alternative 2 */
#define PIN_OUTPUT_MODE_ALT3       (_PIN_OUTPUT_MODE_ALT3 << _PIN_OUTPUT_MODE_SHIFT) /* 011 Output Alternative 3 */
#define PIN_OUTPUT_MODE_ALT4       (_PIN_OUTPUT_MODE_ALT4 << _PIN_OUTPUT_MODE_SHIFT) /* 100 Output Alternative 4 */
#define PIN_OUTPUT_MODE_ALT5       (_PIN_OUTPUT_MODE_ALT5 << _PIN_OUTPUT_MODE_SHIFT) /* 101 Output Alternative 5 */
#define PIN_OUTPUT_MODE_ALT6       (_PIN_OUTPUT_MODE_ALT6 << _PIN_OUTPUT_MODE_SHIFT) /* 110 Output Alternative 6 */
#define PIN_OUTPUT_MODE_ALT7       (_PIN_OUTPUT_MODE_ALT7 << _PIN_OUTPUT_MODE_SHIFT) /* 111 Output Alternative 7 */

/* Four bits define the input multiplexing (together with the IMCR field):
 *
 * ---- ---- ---- ---- -ttt t--- ---- ----
 */

#define _PIN_INPUT_MODE_SHIFT      (11) /* Bits 11-14: Pin Input Mode */
#define _PIN_INPUT_MODE_MASK       (0x0f << _PIN_INPUT_MODE_SHIFT)

#define _PIN_INPUT_MODE_DIS        (0x00) /* 0000 Input Signal Disabled (- Does NOT disable the input buffer!) */
#define _PIN_INPUT_MODE_ALT0       _PIN_INPUT_MODE_DIS
#define _PIN_INPUT_MODE_ALT1       (0x01) /* 0001 Input Alternative 1 */
#define _PIN_INPUT_MODE_ALT2       (0x02) /* 0010 Input Alternative 2 */
#define _PIN_INPUT_MODE_ALT3       (0x03) /* 0011 Input Alternative 3 */
#define _PIN_INPUT_MODE_ALT4       (0x04) /* 0100 Input Alternative 4 */
#define _PIN_INPUT_MODE_ALT5       (0x05) /* 0101 Input Alternative 5 */
#define _PIN_INPUT_MODE_ALT6       (0x06) /* 0110 Input Alternative 6 */
#define _PIN_INPUT_MODE_ALT7       (0x07) /* 0111 Input Alternative 7 */
#define _PIN_INPUT_MODE_ALT8       (0x08) /* 1000 Input Alternative 8 */
#define _PIN_INPUT_MODE_ALT9       (0x09) /* 1001 Input Alternative 9 */
#define _PIN_INPUT_MODE_ALT10      (0x0a) /* 1010 Input Alternative 10 */
#define _PIN_INPUT_MODE_ALT11      (0x0b) /* 1011 Input Alternative 11 */
#define _PIN_INPUT_MODE_WKPU       (0x0c) /* 1100 Use Wakeup Unit for external interrupt */
#define _PIN_INPUT_MODE_ALT13      (0x0d) /* 1101 Unused input mode */
#define _PIN_INPUT_MODE_ALT14      (0x0e) /* 1110 Unused input mode */
#define _PIN_INPUT_MODE_ALT15      (0x0f) /* 1111 Unused input mode */

