apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_pin.h
#define PIN_INPUT_MODE_DIS         (_PIN_INPUT_MODE_DIS   << _PIN_INPUT_MODE_SHIFT) /* 0000 Input Signal Disabled (- Does NOT disable the input buffer!) */
#define PIN_INPUT_MODE_ALT0        PIN_INPUT_MODE_DIS
#define PIN_INPUT_MODE_ALT1        (_PIN_INPUT_MODE_ALT1  << _PIN_INPUT_MODE_SHIFT) /* 0001 Input Alternative 1 */
#define PIN_INPUT_MODE_ALT2        (_PIN_INPUT_MODE_ALT2  << _PIN_INPUT_MODE_SHIFT) /* 0010 Input Alternative 2 */
#define PIN_INPUT_MODE_ALT3        (_PIN_INPUT_MODE_ALT3  << _PIN_INPUT_MODE_SHIFT) /* 0011 Input Alternative 3 */
#define PIN_INPUT_MODE_ALT4        (_PIN_INPUT_MODE_ALT4  << _PIN_INPUT_MODE_SHIFT) /* 0100 Input Alternative 4 */
#define PIN_INPUT_MODE_ALT5        (_PIN_INPUT_MODE_ALT5  << _PIN_INPUT_MODE_SHIFT) /* 0101 Input Alternative 5 */
#define PIN_INPUT_MODE_ALT6        (_PIN_INPUT_MODE_ALT6  << _PIN_INPUT_MODE_SHIFT) /* 0110 Input Alternative 6 */
#define PIN_INPUT_MODE_ALT7        (_PIN_INPUT_MODE_ALT7  << _PIN_INPUT_MODE_SHIFT) /* 0111 Input Alternative 7 */
#define PIN_INPUT_MODE_ALT8        (_PIN_INPUT_MODE_ALT8  << _PIN_INPUT_MODE_SHIFT) /* 1000 Input Alternative 8 */
#define PIN_INPUT_MODE_ALT9        (_PIN_INPUT_MODE_ALT9  << _PIN_INPUT_MODE_SHIFT) /* 1001 Input Alternative 9 */
#define PIN_INPUT_MODE_ALT10       (_PIN_INPUT_MODE_ALT10 << _PIN_INPUT_MODE_SHIFT) /* 1010 Input Alternative 10 */
#define PIN_INPUT_MODE_ALT11       (_PIN_INPUT_MODE_ALT11 << _PIN_INPUT_MODE_SHIFT) /* 1011 Input Alternative 11 */
#define PIN_INPUT_MODE_WKPU        (_PIN_INPUT_MODE_WKPU  << _PIN_INPUT_MODE_SHIFT) /* 1100 Use Wakeup Unit for external interrupt */
#define PIN_INPUT_MODE_ALT13       (_PIN_INPUT_MODE_ALT13 << _PIN_INPUT_MODE_SHIFT) /* 1101 Unused input mode */
#define PIN_INPUT_MODE_ALT14       (_PIN_INPUT_MODE_ALT14 << _PIN_INPUT_MODE_SHIFT) /* 1110 Unused input mode */
#define PIN_INPUT_MODE_ALT15       (_PIN_INPUT_MODE_ALT15 << _PIN_INPUT_MODE_SHIFT) /* 1111 Unused input mode */

/* Nine bits specify the IMCR number for the input multiplexing:
 *
 * ---- ---- iiii iiii i--- ---- ---- ----
 */

#define _IMCR_SHIFT                (15) /* Bits 15-23: IMCR */
#define _IMCR_MASK                 (0x01ff << _IMCR_SHIFT)
#  define IMCR(n)                  ((((n) - 512) << _IMCR_SHIFT) & _IMCR_MASK)

#define _WKPU_SHIFT                _IMCR_SHIFT /* WKPU number reuses the IMCR field, only applicable if Input SSS = 12 */
#define _WKPU_MASK                 (0x3f << _WKPU_SHIFT)
#  define WPKU(n)                  (((n) << _WKPU_SHIFT) & _WKPU_MASK)

/* Eight bits are used to define various pin options:
 *
 * oooo oooo ---- ---- ---- ---- ---- ----
 */

#define _PIN_OPTIONS_SHIFT         (24) /* Bits 24-30: GPIO Pin Options */
#define _PIN_OPTIONS_MASK          (0x7f << _PIN_OPTIONS_SHIFT)

/* Of which two bits are used to define pull-up/pull-down behavior:
 *
 * ---- --oo ---- ---- ---- ---- ---- ----
 */

#define _PIN_INPUT_PULL_SHIFT      (24) /* Bits 24-25: Pull-Down/Pull-Up Behavior */
#define _PIN_INPUT_PULL_MASK       (0x03 << _PIN_INPUT_PULL_SHIFT)
#  define _PIN_INPUT_PULLENABLE    (0x01 << _PIN_INPUT_PULL_SHIFT) /* Pull Enable (PUE) */
#  define _PIN_INPUT_PULLSELECT    (0x02 << _PIN_INPUT_PULL_SHIFT) /* Pull Select (PUS) */
#  define PIN_INPUT_PULLDOWN       (0x01 << _PIN_INPUT_PULL_SHIFT) /* Pull-Down */
#  define PIN_INPUT_PULLUP         (0x03 << _PIN_INPUT_PULL_SHIFT) /* Pull-Up */

/* One bit enables the output buffer:
 *
 * ---- -o-- ---- ---- ---- ---- ---- ----
 */

#define _PIN_OUTPUT_BUFFER_SHIFT   (26) /* Bit 26: Output Buffer Enable */
#define _PIN_OUTPUT_BUFFER_MASK    (1 << _PIN_OUTPUT_BUFFER_SHIFT)
#  define PIN_OUTPUT_BUFFERDIS     (0 << _PIN_OUTPUT_BUFFER_SHIFT)
#  define PIN_OUTPUT_BUFFERENA     (1 << _PIN_OUTPUT_BUFFER_SHIFT)

/* One bit defines the drive strength:
 *
 * ---- o--- ---- ---- ---- ---- ---- ----
 */

#define _PIN_OUTPUT_DRIVE_SHIFT    (27) /* Bit 27: Drive Strength Enable */
#define _PIN_OUTPUT_DRIVE_MASK     (1 << _PIN_OUTPUT_DRIVE_SHIFT)
#  define PIN_OUTPUT_LOWDRIVE      (0 << _PIN_OUTPUT_DRIVE_SHIFT)
#  define PIN_OUTPUT_HIGHDRIVE     (1 << _PIN_OUTPUT_DRIVE_SHIFT)

/* One bit defines the slew rate:
 *
 * ---o ---- ---- ---- ---- ---- ---- ----
 */

#define _PIN_OUTPUT_SLEW_SHIFT     (28) /* Bit 28: Slew Rate Control */
#define _PIN_OUTPUT_SLEW_MASK      (1 << _PIN_OUTPUT_SLEW_SHIFT)
#  define PIN_OUTPUT_FASTSLEW      (0 << _PIN_OUTPUT_SLEW_SHIFT) /* 0: Fast Slew Rate */
#  define PIN_OUTPUT_SLOWSLEW      (1 << _PIN_OUTPUT_SLEW_SHIFT) /* 1: Slow (Limited) Slew Rate */

/* The initial value for GPIO (Alternative 0 outputs):
 *
 * --o- ---- ---- ---- ---- ---- ---- ----
 */

#define _PIN_OUTPUT_INVAL_SHIFT    (29) /* Bit 29: GPIO Initial Value */
#define _PIN_OUTPUT_INVAL_MASK     (1 << _PIN_OUTPUT_INVAL_SHIFT)
#  define GPIO_OUTPUT_ZERO         (0 << _PIN_OUTPUT_INVAL_SHIFT) /* 0: Initial output value is 0 */
#  define GPIO_OUTPUT_ONE          (1 << _PIN_OUTPUT_INVAL_SHIFT) /* 1: Initial output value is 1 */

/* Two bits are used to encode interrupt options:
 *
 * oo- ---- ---- ---- ---- ---- ---- ----
 *
 * TO DO: May be expanded to include DMA options by reusing bits that are
 *        only relevant for outputs.
 */

#define _PIN_INT_SHIFT             (30)
#define _PIN_INT_MASK              (0x03 << _PIN_INT_SHIFT)
#  define PIN_INT_RISING           (0x01 << _PIN_INT_SHIFT) /* 01: Interrupt on rising edge */
#  define PIN_INT_FALLING          (0x02 << _PIN_INT_SHIFT) /* 10: Interrupt on falling edge */
#  define PIN_INT_BOTH             (0x03 << _PIN_INT_SHIFT) /* 11: Interrupt on both edges */

/* End-user pin modes and configurations.
 *
 * Notes:
 * (1) None of the digital options are available for analog functions, which
 * are handled in parallel and are configured elsewhere.
 * (2) Digital settings may be combined (OR'ed) provided that input-only
 * and output-only options are not intermixed.
 */

/* GPIO pins */

#define GPIO_INPUT                 PIN_MODE_GPIO /* Note: Input Buffer will always be enabled for all configured pins! */
#define GPIO_PULLDOWN              (PIN_MODE_GPIO | PIN_INPUT_PULLDOWN)
#define GPIO_PULLUP                (PIN_MODE_GPIO | PIN_INPUT_PULLUP)
#define GPIO_OUTPUT                (PIN_MODE_GPIO | PIN_OUTPUT_BUFFERENA)
#define GPIO_LOWDRIVE              (PIN_MODE_GPIO | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_LOWDRIVE)
#define GPIO_HIGHDRIVE             (PIN_MODE_GPIO | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_HIGHDRIVE)
#define GPIO_FASTSLEW              (PIN_MODE_GPIO | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_FASTSLEW)
#define GPIO_SLOWSLEW              (PIN_MODE_GPIO | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_SLOWSLEW)

