apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_pin.h
/* Outputs */

#define PIN_OUTPUT_ALT0            (PIN_OUTPUT_MODE_ALT0 | PIN_OUTPUT_BUFFERENA)
#define PIN_OUTPUT_ALT0_LOWDRIVE   (PIN_OUTPUT_MODE_ALT0 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_LOWDRIVE)
#define PIN_OUTPUT_ALT0_HIGHDRIVE  (PIN_OUTPUT_MODE_ALT0 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_HIGHDRIVE)
#define PIN_OUTPUT_ALT0_FASTSLEW   (PIN_OUTPUT_MODE_ALT0 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_FASTSLEW)
#define PIN_OUTPUT_ALT0_SLOWSLEW   (PIN_OUTPUT_MODE_ALT0 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_SLOWSLEW)

#define PIN_OUTPUT_ALT1            (PIN_OUTPUT_MODE_ALT1 | PIN_OUTPUT_BUFFERENA)
#define PIN_OUTPUT_ALT1_LOWDRIVE   (PIN_OUTPUT_MODE_ALT1 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_LOWDRIVE)
#define PIN_OUTPUT_ALT1_HIGHDRIVE  (PIN_OUTPUT_MODE_ALT1 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_HIGHDRIVE)
#define PIN_OUTPUT_ALT1_FASTSLEW   (PIN_OUTPUT_MODE_ALT1 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_FASTSLEW)
#define PIN_OUTPUT_ALT1_SLOWSLEW   (PIN_OUTPUT_MODE_ALT1 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_SLOWSLEW)

#define PIN_OUTPUT_ALT2            (PIN_OUTPUT_MODE_ALT2 | PIN_OUTPUT_BUFFERENA)
#define PIN_OUTPUT_ALT2_LOWDRIVE   (PIN_OUTPUT_MODE_ALT2 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_LOWDRIVE)
#define PIN_OUTPUT_ALT2_HIGHDRIVE  (PIN_OUTPUT_MODE_ALT2 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_HIGHDRIVE)
#define PIN_OUTPUT_ALT2_FASTSLEW   (PIN_OUTPUT_MODE_ALT2 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_FASTSLEW)
#define PIN_OUTPUT_ALT2_SLOWSLEW   (PIN_OUTPUT_MODE_ALT2 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_SLOWSLEW)

#define PIN_OUTPUT_ALT3            (PIN_OUTPUT_MODE_ALT3 | PIN_OUTPUT_BUFFERENA)
#define PIN_OUTPUT_ALT3_LOWDRIVE   (PIN_OUTPUT_MODE_ALT3 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_LOWDRIVE)
#define PIN_OUTPUT_ALT3_HIGHDRIVE  (PIN_OUTPUT_MODE_ALT3 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_HIGHDRIVE)
#define PIN_OUTPUT_ALT3_FASTSLEW   (PIN_OUTPUT_MODE_ALT3 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_FASTSLEW)
#define PIN_OUTPUT_ALT3_SLOWSLEW   (PIN_OUTPUT_MODE_ALT3 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_SLOWSLEW)

#define PIN_OUTPUT_ALT4            (PIN_OUTPUT_MODE_ALT4 | PIN_OUTPUT_BUFFERENA)
#define PIN_OUTPUT_ALT4_LOWDRIVE   (PIN_OUTPUT_MODE_ALT4 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_LOWDRIVE)
#define PIN_OUTPUT_ALT4_HIGHDRIVE  (PIN_OUTPUT_MODE_ALT4 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_HIGHDRIVE)
#define PIN_OUTPUT_ALT4_FASTSLEW   (PIN_OUTPUT_MODE_ALT4 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_FASTSLEW)
#define PIN_OUTPUT_ALT4_SLOWSLEW   (PIN_OUTPUT_MODE_ALT4 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_SLOWSLEW)

#define PIN_OUTPUT_ALT5            (PIN_OUTPUT_MODE_ALT5 | PIN_OUTPUT_BUFFERENA)
#define PIN_OUTPUT_ALT5_LOWDRIVE   (PIN_OUTPUT_MODE_ALT5 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_LOWDRIVE)
#define PIN_OUTPUT_ALT5_HIGHDRIVE  (PIN_OUTPUT_MODE_ALT5 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_HIGHDRIVE)
#define PIN_OUTPUT_ALT5_FASTSLEW   (PIN_OUTPUT_MODE_ALT5 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_FASTSLEW)
#define PIN_OUTPUT_ALT5_SLOWSLEW   (PIN_OUTPUT_MODE_ALT5 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_SLOWSLEW)

#define PIN_OUTPUT_ALT6            (PIN_OUTPUT_MODE_ALT6 | PIN_OUTPUT_BUFFERENA)
#define PIN_OUTPUT_ALT6_LOWDRIVE   (PIN_OUTPUT_MODE_ALT6 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_LOWDRIVE)
#define PIN_OUTPUT_ALT6_HIGHDRIVE  (PIN_OUTPUT_MODE_ALT6 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_HIGHDRIVE)
#define PIN_OUTPUT_ALT6_FASTSLEW   (PIN_OUTPUT_MODE_ALT6 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_FASTSLEW)
#define PIN_OUTPUT_ALT6_SLOWSLEW   (PIN_OUTPUT_MODE_ALT6 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_SLOWSLEW)

#define PIN_OUTPUT_ALT7            (PIN_OUTPUT_MODE_ALT7 | PIN_OUTPUT_BUFFERENA)
#define PIN_OUTPUT_ALT7_LOWDRIVE   (PIN_OUTPUT_MODE_ALT7 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_LOWDRIVE)
#define PIN_OUTPUT_ALT7_HIGHDRIVE  (PIN_OUTPUT_MODE_ALT7 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_HIGHDRIVE)
#define PIN_OUTPUT_ALT7_FASTSLEW   (PIN_OUTPUT_MODE_ALT7 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_FASTSLEW)
#define PIN_OUTPUT_ALT7_SLOWSLEW   (PIN_OUTPUT_MODE_ALT7 | PIN_OUTPUT_BUFFERENA | PIN_OUTPUT_SLOWSLEW)

/* Inputs */

#define PIN_INPUT_ALT1             PIN_INPUT_MODE_ALT1
#define PIN_INPUT_ALT1_PULLDOWN    (PIN_INPUT_MODE_ALT1  | PIN_INPUT_PULLDOWN)
#define PIN_INPUT_ALT1_PULLUP      (PIN_INPUT_MODE_ALT1  | PIN_INPUT_PULLUP)

#define PIN_INPUT_ALT2             PIN_INPUT_MODE_ALT2
#define PIN_INPUT_ALT2_PULLDOWN    (PIN_INPUT_MODE_ALT2  | PIN_INPUT_PULLDOWN)
#define PIN_INPUT_ALT2_PULLUP      (PIN_INPUT_MODE_ALT2  | PIN_INPUT_PULLUP)

#define PIN_INPUT_ALT3             PIN_INPUT_MODE_ALT3
#define PIN_INPUT_ALT3_PULLDOWN    (PIN_INPUT_MODE_ALT3  | PIN_INPUT_PULLDOWN)
#define PIN_INPUT_ALT3_PULLUP      (PIN_INPUT_MODE_ALT3  | PIN_INPUT_PULLUP)

#define PIN_INPUT_ALT4             PIN_INPUT_MODE_ALT4
#define PIN_INPUT_ALT4_PULLDOWN    (PIN_INPUT_MODE_ALT4  | PIN_INPUT_PULLDOWN)
#define PIN_INPUT_ALT4_PULLUP      (PIN_INPUT_MODE_ALT4  | PIN_INPUT_PULLUP)

#define PIN_INPUT_ALT5             PIN_INPUT_MODE_ALT5
#define PIN_INPUT_ALT5_PULLDOWN    (PIN_INPUT_MODE_ALT5  | PIN_INPUT_PULLDOWN)
#define PIN_INPUT_ALT5_PULLUP      (PIN_INPUT_MODE_ALT5  | PIN_INPUT_PULLUP)

#define PIN_INPUT_ALT6             PIN_INPUT_MODE_ALT6
#define PIN_INPUT_ALT6_PULLDOWN    (PIN_INPUT_MODE_ALT6  | PIN_INPUT_PULLDOWN)
#define PIN_INPUT_ALT6_PULLUP      (PIN_INPUT_MODE_ALT6  | PIN_INPUT_PULLUP)

#define PIN_INPUT_ALT7             PIN_INPUT_MODE_ALT7
#define PIN_INPUT_ALT7_PULLDOWN    (PIN_INPUT_MODE_ALT7  | PIN_INPUT_PULLDOWN)
#define PIN_INPUT_ALT7_PULLUP      (PIN_INPUT_MODE_ALT7  | PIN_INPUT_PULLUP)

#define PIN_INPUT_ALT8             PIN_INPUT_MODE_ALT8
#define PIN_INPUT_ALT8_PULLDOWN    (PIN_INPUT_MODE_ALT8  | PIN_INPUT_PULLDOWN)
#define PIN_INPUT_ALT8_PULLUP      (PIN_INPUT_MODE_ALT8  | PIN_INPUT_PULLUP)

#define PIN_INPUT_ALT9             PIN_INPUT_MODE_ALT9
#define PIN_INPUT_ALT9_PULLDOWN    (PIN_INPUT_MODE_ALT9  | PIN_INPUT_PULLDOWN)
#define PIN_INPUT_ALT9_PULLUP      (PIN_INPUT_MODE_ALT9  | PIN_INPUT_PULLUP)

#define PIN_INPUT_ALT10            PIN_INPUT_MODE_ALT10
#define PIN_INPUT_ALT10_PULLDOWN   (PIN_INPUT_MODE_ALT10 | PIN_INPUT_PULLDOWN)
#define PIN_INPUT_ALT10_PULLUP     (PIN_INPUT_MODE_ALT10 | PIN_INPUT_PULLUP)

