apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_pin.h
#define PIN_INPUT_ALT11            PIN_INPUT_MODE_ALT11
#define PIN_INPUT_ALT11_PULLDOWN   (PIN_INPUT_MODE_ALT11 | PIN_INPUT_PULLDOWN)
#define PIN_INPUT_ALT11_PULLUP     (PIN_INPUT_MODE_ALT11 | PIN_INPUT_PULLUP)

#define PIN_INPUT_WKPU             PIN_INPUT_MODE_WKPU
#define PIN_INPUT_WKPU_PULLDOWN    (PIN_INPUT_MODE_WKPU  | PIN_INPUT_PULLDOWN)
#define PIN_INPUT_WKPU_PULLUP      (PIN_INPUT_MODE_WKPU  | PIN_INPUT_PULLUP)

/****************************************************************************
 * Inline Functions
 ****************************************************************************/

#ifndef __ASSEMBLY__

/****************************************************************************
 * Public Data
 ****************************************************************************/

#undef EXTERN
#if defined(__cplusplus)
#define EXTERN extern "C"
extern "C"
{
#else
#define EXTERN extern
#endif

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

/****************************************************************************
 * Name: s32k3xx_pinconfig
 *
 * Description:
 *   Configure a pin based on a bit-encoded description of the pin.
 *
 ****************************************************************************/

int s32k3xx_pinconfig(uint32_t cfgset);

/****************************************************************************
 * Name: s32k3xx_gpiowrite
 *
 * Description:
 *   Write one or zero to the selected GPIO pin
 *
 ****************************************************************************/

void s32k3xx_gpiowrite(uint32_t pinset, bool value);

/****************************************************************************
 * Name: s32k3xx_gpioread
 *
 * Description:
 *   Read one or zero from the selected GPIO pin
 *
 ****************************************************************************/

bool s32k3xx_gpioread(uint32_t pinset);

/****************************************************************************
 * Name: s32k3xx_pinirq_initialize
 *
 * Description:
 *   Initialize logic to support a second level of interrupt decoding for
 *   GPIO pins.
 *
 ****************************************************************************/

#ifdef CONFIG_S32K3XX_GPIOIRQ
void s32k3xx_pinirq_initialize(void);
#else
#  define s32k3xx_pinirq_initialize()
#endif

/****************************************************************************
 * Name: s32k3xx_pinirqattach
 *
 * Description:
 *   Attach a pin interrupt handler.  The normal initialization sequence is:
 *
 *   1. Call s32k3xx_pinconfig() to configure the interrupting pin
 *      (pin interrupts will be disabled.
 *   2. Call s32k3xx_pinirqattach() to attach the pin interrupt handling
 *      function.
 *   3. Call s32k3xx_pinirqenable() to enable interrupts on the pin.
 *
 * Input Parameters:
 *   pinset -  Pin configuration
 *   pinisr -  Pin interrupt service routine
 *   arg    -  An argument that will be provided to the interrupt service
 *             routine.
 *
 * Returned Value:
 *   Zero (OK) is returned on success; a negated errno value is returned on
 *   any failure to indicate the nature of the failure.
 *
 ****************************************************************************/

int s32k3xx_pinirqattach(uint32_t pinset, xcpt_t pinisr, void *arg);

/****************************************************************************
 * Name: s32k3xx_pinirqenable
 *
 * Description:
 *   Enable the interrupt for specified pin IRQ
 *
 ****************************************************************************/

#ifdef CONFIG_S32K3XX_GPIOIRQ
void s32k3xx_pinirqenable(uint32_t pinset);
#else
#  define s32k3xx_pinirqenable(pinset)
#endif

/****************************************************************************
 * Name: s32k3xx_pinirqdisable
 *
 * Description:
 *   Disable the interrupt for specified pin
 *
 ****************************************************************************/

#ifdef CONFIG_S32K3XX_GPIOIRQ
void s32k3xx_pinirqdisable(uint32_t pinset);
#else
#  define s32k3xx_pinirqdisable(pinset)
#endif

/****************************************************************************
 * Name: s32k3xx_pindmaenable
 *
 * Description:
 *   Enable DMA for specified pin
 *
 ****************************************************************************/

#ifdef CONFIG_S32K3XX_DMA
void s32k3xx_pindmaenable(uint32_t pinset);
#endif

/****************************************************************************
 * Name: s32k3xx_pindmadisable
 *
 * Description:
 *   Disable DMA for specified pin
 *
 ****************************************************************************/

#ifdef CONFIG_S32K3XX_DMA
void s32k3xx_pindmadisable(uint32_t pinset);
#endif

/****************************************************************************
 * Function:  s32k3xx_pindump
 *
 * Description:
 *   Dump all GPIO registers associated with the base address of the provided
 *   pinset.
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_GPIO_INFO
void s32k3xx_pindump(uint32_t pinset, const char *msg);
#else
#  define s32k3xx_pindump(p,m)
#endif

#undef EXTERN
#if defined(__cplusplus)
}
#endif

#endif /* __ASSEMBLY__ */
#endif /* __ARCH_ARM_SRC_S32K3XX_S32K3XX_PIN_H */
